workloads/YCSB_rocksdb/luma_test_logs/workloadA_logs/xfs_1dev
<YCSB RocksDB benchmark script>
load YCSB-a x1 & run YCSB-a x10..
*---------------------------------- ycsb load ----------------------------------*
[OVERALL], RunTime(ms), 62557
[OVERALL], Throughput(ops/sec), 15.98542129577825
[TOTAL_GCS_G1_Young_Generation], Count, 244
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 743
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 1.187716802276324
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 244
[TOTAL_GC_TIME], Time(ms), 743
[TOTAL_GC_TIME_%], Time(%), 1.187716802276324
[CLEANUP], Operations, 64
[CLEANUP], AverageLatency(us), 9718.21875
[CLEANUP], MinLatency(us), 3
[CLEANUP], MaxLatency(us), 621567
[CLEANUP], 95thPercentileLatency(us), 21
[CLEANUP], 99thPercentileLatency(us), 68
[INSERT], Operations, 1000
[INSERT], AverageLatency(us), 3789925.888
[INSERT], MinLatency(us), 1048576
[INSERT], MaxLatency(us), 4694015
[INSERT], 95thPercentileLatency(us), 4530175
[INSERT], 99thPercentileLatency(us), 4616191
[INSERT], Return=OK, 1000
*---------------------------------- ycsb load end ------------------------------*
*---------------------------------- ycsb run_1 ----------------------------------*
[OVERALL], RunTime(ms), 109965
[OVERALL], Throughput(ops/sec), 9.093802573546128
[TOTAL_GCS_G1_Young_Generation], Count, 193
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 1875
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 1.705087982539899
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 193
[TOTAL_GC_TIME], Time(ms), 1875
[TOTAL_GC_TIME_%], Time(%), 1.705087982539899
[READ], Operations, 483
[READ], AverageLatency(us), 575305.2753623188
[READ], MinLatency(us), 18880
[READ], MaxLatency(us), 4739071
[READ], 95thPercentileLatency(us), 2789375
[READ], 99thPercentileLatency(us), 4583423
[READ], Return=OK, 483
[CLEANUP], Operations, 64
[CLEANUP], AverageLatency(us), 2861.75
[CLEANUP], MinLatency(us), 9
[CLEANUP], MaxLatency(us), 181759
[CLEANUP], 95thPercentileLatency(us), 40
[CLEANUP], 99thPercentileLatency(us), 91
[UPDATE], Operations, 517
[UPDATE], AverageLatency(us), 1.1989754553191489E7
[UPDATE], MinLatency(us), 356352
[UPDATE], MaxLatency(us), 62390271
[UPDATE], 95thPercentileLatency(us), 58097663
[UPDATE], 99thPercentileLatency(us), 61407231
[UPDATE], Return=OK, 517
*---------------------------------- ycsb run end ------------------------------*
*---------------------------------- ycsb run_2 ----------------------------------*
[OVERALL], RunTime(ms), 56966
[OVERALL], Throughput(ops/sec), 17.554330653372187
[TOTAL_GCS_G1_Young_Generation], Count, 140
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 1237
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 2.1714707018221397
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 140
[TOTAL_GC_TIME], Time(ms), 1237
[TOTAL_GC_TIME_%], Time(%), 2.1714707018221397
[READ], Operations, 512
[READ], AverageLatency(us), 660262.78125
[READ], MinLatency(us), 19312
[READ], MaxLatency(us), 2852863
[READ], 95thPercentileLatency(us), 2357247
[READ], 99thPercentileLatency(us), 2449407
[READ], Return=OK, 512
[CLEANUP], Operations, 64
[CLEANUP], AverageLatency(us), 7423.5
[CLEANUP], MinLatency(us), 4
[CLEANUP], MaxLatency(us), 473855
[CLEANUP], 95thPercentileLatency(us), 44
[CLEANUP], 99thPercentileLatency(us), 137
[UPDATE], Operations, 488
[UPDATE], AverageLatency(us), 5653575.081967213
[UPDATE], MinLatency(us), 424704
[UPDATE], MaxLatency(us), 12156927
[UPDATE], 95thPercentileLatency(us), 10895359
[UPDATE], 99thPercentileLatency(us), 11476991
[UPDATE], Return=OK, 488
*---------------------------------- ycsb run end ------------------------------*
*---------------------------------- ycsb run_3 ----------------------------------*
[OVERALL], RunTime(ms), 76591
[OVERALL], Throughput(ops/sec), 13.056364324790119
[TOTAL_GCS_G1_Young_Generation], Count, 90
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 985
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 1.2860518859918266
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 90
[TOTAL_GC_TIME], Time(ms), 985
[TOTAL_GC_TIME_%], Time(%), 1.2860518859918266
[READ], Operations, 488
[READ], AverageLatency(us), 662651.7459016393
[READ], MinLatency(us), 15064
[READ], MaxLatency(us), 3284991
[READ], 95thPercentileLatency(us), 1904639
[READ], 99thPercentileLatency(us), 2842623
[READ], Return=OK, 488
[CLEANUP], Operations, 64
[CLEANUP], AverageLatency(us), 17375.796875
[CLEANUP], MinLatency(us), 4
[CLEANUP], MaxLatency(us), 1111039
[CLEANUP], 95thPercentileLatency(us), 82
[CLEANUP], 99thPercentileLatency(us), 126
[UPDATE], Operations, 512
[UPDATE], AverageLatency(us), 7549531.8125
[UPDATE], MinLatency(us), 125760
[UPDATE], MaxLatency(us), 19005439
[UPDATE], 95thPercentileLatency(us), 16105471
[UPDATE], 99thPercentileLatency(us), 18120703
[UPDATE], Return=OK, 512
*---------------------------------- ycsb run end ------------------------------*
*---------------------------------- ycsb run_4 ----------------------------------*
[OVERALL], RunTime(ms), 76091
[OVERALL], Throughput(ops/sec), 13.142158730993152
[TOTAL_GCS_G1_Young_Generation], Count, 236
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 1615
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 2.1224586350553944
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 236
[TOTAL_GC_TIME], Time(ms), 1615
[TOTAL_GC_TIME_%], Time(%), 2.1224586350553944
[READ], Operations, 508
[READ], AverageLatency(us), 595948.2992125985
[READ], MinLatency(us), 16528
[READ], MaxLatency(us), 2621439
[READ], 95thPercentileLatency(us), 1780735
[READ], 99thPercentileLatency(us), 2353151
[READ], Return=OK, 508
[CLEANUP], Operations, 64
[CLEANUP], AverageLatency(us), 10648.109375
[CLEANUP], MinLatency(us), 8
[CLEANUP], MaxLatency(us), 680447
[CLEANUP], 95thPercentileLatency(us), 42
[CLEANUP], 99thPercentileLatency(us), 113
[UPDATE], Operations, 492
[UPDATE], AverageLatency(us), 8042409.040650407
[UPDATE], MinLatency(us), 108800
[UPDATE], MaxLatency(us), 19152895
[UPDATE], 95thPercentileLatency(us), 16621567
[UPDATE], 99thPercentileLatency(us), 18644991
[UPDATE], Return=OK, 492
*---------------------------------- ycsb run end ------------------------------*
*---------------------------------- ycsb run_5 ----------------------------------*
[OVERALL], RunTime(ms), 84169
[OVERALL], Throughput(ops/sec), 11.88085874847034
[TOTAL_GCS_G1_Young_Generation], Count, 84
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 1019
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 1.2106595064691277
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 84
[TOTAL_GC_TIME], Time(ms), 1019
[TOTAL_GC_TIME_%], Time(%), 1.2106595064691277
[READ], Operations, 501
[READ], AverageLatency(us), 737339.9520958083
[READ], MinLatency(us), 13152
[READ], MaxLatency(us), 4866047
[READ], 95thPercentileLatency(us), 3340287
[READ], 99thPercentileLatency(us), 3790847
[READ], Return=OK, 501
[CLEANUP], Operations, 64
[CLEANUP], AverageLatency(us), 9476.34375
[CLEANUP], MinLatency(us), 4
[CLEANUP], MaxLatency(us), 605695
[CLEANUP], 95thPercentileLatency(us), 30
[CLEANUP], 99thPercentileLatency(us), 126
[UPDATE], Operations, 499
[UPDATE], AverageLatency(us), 8794056.08016032
[UPDATE], MinLatency(us), 286976
[UPDATE], MaxLatency(us), 28524543
[UPDATE], 95thPercentileLatency(us), 19988479
[UPDATE], 99thPercentileLatency(us), 27738111
[UPDATE], Return=OK, 499
*---------------------------------- ycsb run end ------------------------------*
*---------------------------------- ycsb run_6 ----------------------------------*
[OVERALL], RunTime(ms), 70935
[OVERALL], Throughput(ops/sec), 14.097413124691618
[TOTAL_GCS_G1_Young_Generation], Count, 86
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 1016
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 1.4322971734686685
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 86
[TOTAL_GC_TIME], Time(ms), 1016
[TOTAL_GC_TIME_%], Time(%), 1.4322971734686685
[READ], Operations, 501
[READ], AverageLatency(us), 764316.5508982036
[READ], MinLatency(us), 18624
[READ], MaxLatency(us), 4231167
[READ], 95thPercentileLatency(us), 2711551
[READ], 99thPercentileLatency(us), 3162111
[READ], Return=OK, 501
[CLEANUP], Operations, 64
[CLEANUP], AverageLatency(us), 6052.84375
[CLEANUP], MinLatency(us), 4
[CLEANUP], MaxLatency(us), 386047
[CLEANUP], 95thPercentileLatency(us), 72
[CLEANUP], 99thPercentileLatency(us), 196
[UPDATE], Operations, 499
[UPDATE], AverageLatency(us), 7085841.955911824
[UPDATE], MinLatency(us), 429312
[UPDATE], MaxLatency(us), 17612799
[UPDATE], 95thPercentileLatency(us), 13844479
[UPDATE], 99thPercentileLatency(us), 15196159
[UPDATE], Return=OK, 499
*---------------------------------- ycsb run end ------------------------------*
*---------------------------------- ycsb run_7 ----------------------------------*
[OVERALL], RunTime(ms), 60421
[OVERALL], Throughput(ops/sec), 16.550537064927756
[TOTAL_GCS_G1_Young_Generation], Count, 70
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 1200
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 1.986064447791331
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 70
[TOTAL_GC_TIME], Time(ms), 1200
[TOTAL_GC_TIME_%], Time(%), 1.986064447791331
[READ], Operations, 525
[READ], AverageLatency(us), 842040.380952381
[READ], MinLatency(us), 18768
[READ], MaxLatency(us), 4169727
[READ], 95thPercentileLatency(us), 3217407
[READ], 99thPercentileLatency(us), 4050943
[READ], Return=OK, 525
[CLEANUP], Operations, 64
[CLEANUP], AverageLatency(us), 2548.53125
[CLEANUP], MinLatency(us), 7
[CLEANUP], MaxLatency(us), 161407
[CLEANUP], 95thPercentileLatency(us), 71
[CLEANUP], 99thPercentileLatency(us), 132
[UPDATE], Operations, 475
[UPDATE], AverageLatency(us), 5724376.117894737
[UPDATE], MinLatency(us), 342016
[UPDATE], MaxLatency(us), 11485183
[UPDATE], 95thPercentileLatency(us), 8544255
[UPDATE], 99thPercentileLatency(us), 10502143
[UPDATE], Return=OK, 475
*---------------------------------- ycsb run end ------------------------------*
*---------------------------------- ycsb run_8 ----------------------------------*
[OVERALL], RunTime(ms), 84013
[OVERALL], Throughput(ops/sec), 11.90291978622356
[TOTAL_GCS_G1_Young_Generation], Count, 81
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 1159
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 1.3795484032233107
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 81
[TOTAL_GC_TIME], Time(ms), 1159
[TOTAL_GC_TIME_%], Time(%), 1.3795484032233107
[READ], Operations, 490
[READ], AverageLatency(us), 745022.1795918368
[READ], MinLatency(us), 15712
[READ], MaxLatency(us), 5648383
[READ], 95thPercentileLatency(us), 4206591
[READ], 99thPercentileLatency(us), 5316607
[READ], Return=OK, 490
[CLEANUP], Operations, 64
[CLEANUP], AverageLatency(us), 22043.859375
[CLEANUP], MinLatency(us), 8
[CLEANUP], MaxLatency(us), 1410047
[CLEANUP], 95thPercentileLatency(us), 46
[CLEANUP], 99thPercentileLatency(us), 113
[UPDATE], Operations, 510
[UPDATE], AverageLatency(us), 8803892.956862746
[UPDATE], MinLatency(us), 339968
[UPDATE], MaxLatency(us), 30523391
[UPDATE], 95thPercentileLatency(us), 26689535
[UPDATE], 99thPercentileLatency(us), 29245439
[UPDATE], Return=OK, 510
*---------------------------------- ycsb run end ------------------------------*
*---------------------------------- ycsb run_9 ----------------------------------*
[OVERALL], RunTime(ms), 77621
[OVERALL], Throughput(ops/sec), 12.883111529096507
[TOTAL_GCS_G1_Young_Generation], Count, 193
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 1381
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 1.7791577021682277
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 193
[TOTAL_GC_TIME], Time(ms), 1381
[TOTAL_GC_TIME_%], Time(%), 1.7791577021682277
[READ], Operations, 502
[READ], AverageLatency(us), 597026.2151394422
[READ], MinLatency(us), 16560
[READ], MaxLatency(us), 2541567
[READ], 95thPercentileLatency(us), 1738751
[READ], 99thPercentileLatency(us), 2443263
[READ], Return=OK, 502
[CLEANUP], Operations, 64
[CLEANUP], AverageLatency(us), 20103.90625
[CLEANUP], MinLatency(us), 8
[CLEANUP], MaxLatency(us), 1286143
[CLEANUP], 95thPercentileLatency(us), 29
[CLEANUP], 99thPercentileLatency(us), 33
[UPDATE], Operations, 498
[UPDATE], AverageLatency(us), 8110629.397590362
[UPDATE], MinLatency(us), 244992
[UPDATE], MaxLatency(us), 27000831
[UPDATE], 95thPercentileLatency(us), 24756223
[UPDATE], 99thPercentileLatency(us), 26689535
[UPDATE], Return=OK, 498
*---------------------------------- ycsb run end ------------------------------*
*---------------------------------- ycsb run_10 ----------------------------------*
[OVERALL], RunTime(ms), 89840
[OVERALL], Throughput(ops/sec), 11.130899376669635
[TOTAL_GCS_G1_Young_Generation], Count, 159
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 1321
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 1.4703918076580587
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 159
[TOTAL_GC_TIME], Time(ms), 1321
[TOTAL_GC_TIME_%], Time(%), 1.4703918076580587
[READ], Operations, 497
[READ], AverageLatency(us), 613083.8390342052
[READ], MinLatency(us), 14368
[READ], MaxLatency(us), 3323903
[READ], 95thPercentileLatency(us), 2603007
[READ], 99thPercentileLatency(us), 2709503
[READ], Return=OK, 497
[CLEANUP], Operations, 64
[CLEANUP], AverageLatency(us), 19205.890625
[CLEANUP], MinLatency(us), 7
[CLEANUP], MaxLatency(us), 1228799
[CLEANUP], 95thPercentileLatency(us), 26
[CLEANUP], 99thPercentileLatency(us), 27
[UPDATE], Operations, 503
[UPDATE], AverageLatency(us), 9420055.157057654
[UPDATE], MinLatency(us), 355840
[UPDATE], MaxLatency(us), 35782655
[UPDATE], 95thPercentileLatency(us), 26623999
[UPDATE], 99thPercentileLatency(us), 35422207
[UPDATE], Return=OK, 503
*---------------------------------- ycsb run end ------------------------------*
experiment end.